# GUI Applications
cask "alacritty" # A fast, cross-platform, GPU-accelerated terminal emulator.
cask "firefox" # A free and open-source web browser.
cask "firefox@developer-edition" # A version of Firefox with developer tools and features.

# CLI Tools
brew "asdf" # A version manager for multiple language runtimes.
brew "bash" # A Unix shell and command language.
brew "bc" # An arbitrary-precision calculator language.
brew "coreutils" # GNU's core utilities, like `ls`, `cat`, and `mv`.
brew "gawk" # GNU's version of `awk`, a pattern scanning and processing language.
brew "gh" # The official GitHub CLI tool.
brew "glab" # An open-source GitLab CLI tool.
brew "gsed" # GNU's version of `sed`, a stream editor.
brew "jq" # A lightweight and flexible command-line JSON processor.
brew "nowplaying-cli" # A command-line tool to retrieve currently playing media information on macOS.
brew "starship" # A fast, customizable, cross-shell prompt.
brew "stow" # A tool for managing symbolic links to dotfiles.
brew "tmux" # A terminal multiplexer for managing multiple terminal sessions.

# Fonts
cask "font-fira-code-nerd-font" # A programming font with ligatures and a high number of glyphs.
cask "font-monospace-nerd-font" # A monospaced font with additional glyphs and icons.
cask "font-noto-sans-symbols-2" # A font containing symbols and emojis.
